# Breakout Problems
---
# Notebook: Data-X HW11 Fall2017

**Author list:** Deepankar Singh

___

# INTRODUCTION TO SQL

In this intro to SQL you can either use an SQL online editor (or sqlite3 with pandas in this notebook): 

### [https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all](https://www.w3schools.com/sql/trysql.asp?filename=trysql_select_all)

There are already some tables in the online Database, namely: 

	Categories, Employees, OrderDetails	, Orders, Products, Shippers, and Suppliers. 

We are not going to use them, and if you want you can drop them by running `DROP TABLE [table-name];`



## Exercises: Let's play with Dogs (& SQL)

First create a table called parents. It has two columns: 'parent' and 'child'. The first column indicates the parent of the child in the second column. We will use a new form of `CREATE TABLE` expression to produce this table.

	CREATE TABLE parents AS
	  SELECT "abraham" AS parent, "barack" AS child UNION
	  SELECT "abraham",           "clinton"         UNION
	  SELECT "delano",            "herbert"         UNION
	  SELECT "fillmore",          "abraham"         UNION
	  SELECT "fillmore",          "delano"          UNION
	  SELECT "fillmore",          "grover"          UNION
	  SELECT "eisenhower",        "fillmore";
	  

### Picture of the Dog Family Tree (illustration of parents table)

(A = abrham, B = barack, etc.)

<center><img src="https://github.com/alexanderfo/data-x_public/raw/master/L13_SQL/imgs/family_tree.png" width="200" /></center>
	  
## Q1 Simple SELECTS (on the parents table)
1. SELECT all records in the table.
2. SELECT child and parent, where abraham is the parent.
3. SELECT all children that have an 'e' in their name (hint: use LIKE and '%e%').
4. SELECT all unique parents (use SELECT DISTINCT) and order them by name, descending order (i.e. fillmore first)
5. **Difficult***: SELECT all dogs that are siblings (one-to-one relations). Only show a sibling pair once. To do this you need to select two times from the parents table.

## Q2 Joins

Create a new table called dogs, which indicates the fur type of every dog. In the image above: long haired dogs = red dashed box, curly haired dogs = black fluffy box, and short haired dogs = grey dotted box. 

Create the table by running:
	
	CREATE TABLE dogs AS
	  SELECT "abraham" AS name, "long" AS fur UNION
	  SELECT "barack",          "short"       UNION
	  SELECT "clinton",         "long"        UNION
	  SELECT "delano",          "long"        UNION
	  SELECT "eisenhower",      "short"       UNION
	  SELECT "fillmore",        "curly"       UNION
	  SELECT "grover",          "short"       UNION
	  SELECT "herbert",         "curly";

1. COUNT the number of short haired dogs
2. JOIN tables parents and dogs and SELECT the parents of curly dogs.
2. **Difficult**: JOIN tables parents and dogs, and SELECT the parents and children that have the same fur type. Only show them once.


## Q3 Aggregate functions, numerical logic and grouping

Create a new table with many different animals. The table includes the animal's kind, number of legs and weight. Create it by running:

	create table animals as
	 select "dog" as kind, 4 as legs, 20 as weight union
	 select "cat" , 4 , 10 union
	 select "ferret" , 4 , 10 union
	 select "parrot" , 2 , 6 union
	 select "penguin" , 2 , 10 union
	select "t-rex" , 2 , 12000;
	
1. SELECT the animal with the minimum weight. Display kind and min_weight.
2. Use aggregate function AVG to display a table with the average number of legs and the average weight.
3. SELECT the animal kind(s) that have more than two legs, but weighs less than 20. Display kind, weight, legs.
4. SELECT the average weight for all the animals with 2 legs and the animals with 4 legs (by using GROUP BY).

.


*These exercises are inspired by the Lectures in CS61A (Fall 2014).*

## SQLite 3

In [75]:
# sqlite3 package comes with the Python installation
import sqlite3

In [76]:
# list files in w.d.
!ls

Data-X HW11 Fall2017.ipynb Data-X HW11.md
Data-X HW11 Fall2017.pdf   breakout.db

In [77]:
# open connnection to a db file stored locally on disk
# if file doesn't exist it is created
connection = sqlite3.connect('breakout.db')

In [78]:
!ls # file is created

Data-X HW11 Fall2017.ipynb Data-X HW11.md
Data-X HW11 Fall2017.pdf   breakout.db

In [79]:
# In order to run SQL commands with
# sqlite 3 we must create a cursor object
# that traverses the database
cursor = connection.cursor()

# to run sql commands execute them

In [80]:
# Check that we are working with an empty db
cursor.execute("DROP TABLE IF EXISTS parents;")

In [81]:
# We can define long SQL commands within three quotes

sql_command = """
CREATE TABLE parents (
 parent VARCHAR(20),
 child VARCHAR(20));
"""

# VARCHAR string that can be up to X characters
# CHAR has to be X characters

**Link to SQL datatypes:** [https://www.w3schools.com/sql/sql_datatypes.asp](https://www.w3schools.com/sql/sql_datatypes.asp)

In [82]:
# In order to run SQL command on the databse file
# we have to execute them with the cursor
cursor.execute(sql_command)

In [83]:
sql_command = '''
INSERT INTO parents (parent, child)
 VALUES ("abraham", "barack") UNION
 VALUES ("abraham", "clinton") UNION
 VALUES ("delano", "herbert") UNION
 VALUES ("fillmore", "abraham") UNION
 VALUES ("fillmore", "delano") UNION
 VALUES ("fillmore", "grover") UNION
 VALUES ("eisenhower", "fillmore");
 '''

cursor.execute(sql_command)

In [84]:
# never forget to commit your queries
# if you have updated the database
# and close the connection when you're done

connection.commit() 

connection.close()

In [85]:
# reopen the connection and create cursor
connection = sqlite3.connect('breakout.db')

cursor = connection.cursor()

In [86]:
a = cursor.execute('SELECT * FROM parents;')

In [87]:
# fetch values, a.fetchall is a generator object
for row in a.fetchall():
    print(row)

('abraham', 'barack')
('abraham', 'clinton')
('delano', 'herbert')
('eisenhower', 'fillmore')
('fillmore', 'abraham')
('fillmore', 'delano')
('fillmore', 'grover')

In [88]:
# close connection
connection.close()

# Quick Data Analysis with SQL and Pandas

### Q1 Simple SELECTS (on the parents table)

In [89]:
import pandas as pd
import datetime as dt 
connection = sqlite3.connect('breakout.db')
cursor = connection.cursor()

#### 1.1. SELECT all records in the table

In [90]:
pd.read_sql_query('SELECT * FROM parents',con = connection)

       parent     child
0     abraham    barack
1     abraham   clinton
2      delano   herbert
3  eisenhower  fillmore
4    fillmore   abraham
5    fillmore    delano
6    fillmore    grover

#### 1.2. SELECT child and parent, where abraham is the parent.

In [91]:
pd.read_sql_query('SELECT * FROM parents where parent=\'abraham\'',con = connection)

    parent    child
0  abraham   barack
1  abraham  clinton

#### 1.3. SELECT all children that have an 'e' in their name (hint: use LIKE and '%e%').

In [92]:
pd.read_sql_query('SELECT * FROM parents where child LIKE \'%e%\'',con = connection)

       parent     child
0      delano   herbert
1  eisenhower  fillmore
2    fillmore    delano
3    fillmore    grover

#### 1.4. SELECT all unique parents (use SELECT DISTINCT) and order them by name, descending order (i.e.
fillmore first)

In [93]:
pd.read_sql_query(
    '''
    SELECT DISTINCT parent 
    FROM parents
    Order by parent desc
    '''
    ,con = connection)

       parent
0    fillmore
1  eisenhower
2      delano
3     abraham

#### 1.5. SELECT all dogs that are siblings (one-to-one relations). Only show a sibling pair once. To do this you need to select two times from the parents table.

In [94]:
pd.read_sql_query(
    '''
    SELECT pd.parent as parent, pd.child as child1, cd.child as child2
    FROM parents p
    inner join parents pd on p.parent = pd.parent and p.child = pd.child
    inner join parents cd on p.parent = cd.parent and cd.child <> pd.child AND pd.child < cd.child
    '''
    ,con = connection)

     parent   child1   child2
0   abraham   barack  clinton
1  fillmore  abraham   delano
2  fillmore  abraham   grover
3  fillmore   delano   grover

In [95]:
connection.commit()

<div id="sec4"></div>

## Q2 Joins

Create a new table called dogs, which indicates the fur type of every dog. In the image above: long haired dogs = red dashed box, curly haired dogs = black fluffy box, and short haired dogs = grey dotted box. 

Create the table by running:
	
	CREATE TABLE dogs AS
	  SELECT "abraham" AS name, "long" AS fur UNION
	  SELECT "barack",          "short"       UNION
	  SELECT "clinton",         "long"        UNION
	  SELECT "delano",          "long"        UNION
	  SELECT "eisenhower",      "short"       UNION
	  SELECT "fillmore",        "curly"       UNION
	  SELECT "grover",          "short"       UNION
	  SELECT "herbert",         "curly";

1. COUNT the number of short haired dogs
2. JOIN tables parents and dogs and SELECT the parents of curly dogs.
2. **Difficult**: JOIN tables parents and dogs, and SELECT the parents and children that have the same fur type. Only show them once.

In [ ]:
sql_command = '''
CREATE TABLE dogs AS
  SELECT "abraham" AS name, "long" AS fur UNION
  SELECT "barack",          "short"       UNION
  SELECT "clinton",         "long"        UNION
  SELECT "delano",          "long"        UNION
  SELECT "eisenhower",      "short"       UNION
  SELECT "fillmore",        "curly"       UNION
  SELECT "grover",          "short"       UNION
  SELECT "herbert",         "curly";
'''
cursor.execute(sql_command)

In [97]:
connection.commit()

In [100]:
# 2.1 JOIN tables parents and dogs and SELECT the parents of curly dogs.
pd.read_sql_query('SELECT Count(*) FROM dogs WHERE fur="short"',connection)

   Count(*)
0         3

In [101]:
# 2.2. COUNT the number of short haired dogs
pd.read_sql_query(
    '''
    SELECT p.parent, d.name as child, fur
    FROM dogs d
    inner join parents p on p.child = d.name
    WHERE d.fur="curly"
    ''',
    connection)

       parent     child    fur
0  eisenhower  fillmore  curly
1      delano   herbert  curly

In [102]:
# 2.3 JOIN tables parents and dogs, 
# SELECT the parents and children that have the same fur type. Only show them once.
pd.read_sql_query(
    '''
    SELECT pd.name as parent, cd.name as child, pd.fur as parentfur, cd.fur as childfur 
    FROM parents p
    inner join dogs pd on p.parent = pd.name
    inner join dogs cd on p.child = cd.name
    WHERE pd.fur=cd.fur
    ''',
    connection)

    parent    child parentfur childfur
0  abraham  clinton      long     long


## Q3 Aggregate functions, numerical logic and grouping

Create a new table with many different animals. The table includes the animal's kind, number of legs and weight. Create it by running:

	create table animals as
	 select "dog" as kind, 4 as legs, 20 as weight union
	 select "cat" , 4 , 10 union
	 select "ferret" , 4 , 10 union
	 select "parrot" , 2 , 6 union
	 select "penguin" , 2 , 10 union
	select "t-rex" , 2 , 12000;
	
1. SELECT the animal with the minimum weight. Display kind and min_weight.
2. Use aggregate function AVG to display a table with the average number of legs and the average weight.
3. SELECT the animal kind(s) that have more than two legs, but weighs less than 20. Display kind, weight, legs.
4. SELECT the average weight for all the animals with 2 legs and the animals with 4 legs (by using GROUP BY).

.

In [66]:
sql_command = '''
create table animals as
 select "dog" as kind, 4 as legs, 20 as weight union
 select "cat" , 4 , 10 union
 select "ferret" , 4 , 10 union
 select "parrot" , 2 , 6 union
 select "penguin" , 2 , 10 union
select "t-rex" , 2 , 12000;
'''
cursor.execute(sql_command)
connection.commit()

In [103]:
# 1. SELECT the animal with the minimum weight. Display kind and min_weight.
sql_command = '''
SELECT kind, MIN(weight)
FROM animals;
'''
pd.read_sql_query(sql_command,connection)

     kind  MIN(weight)
0  parrot            6

In [104]:
# 2. Use aggregate function AVG to display a table with the average number of legs and the average weight.
sql_command = '''
select avg(legs), avg(weight)
from animals 
'''
pd.read_sql_query(sql_command,connection)

   avg(legs)  avg(weight)
0        3.0  2009.333333

In [105]:
# 3. SELECT the animal kind(s) that have more than two legs, but weighs less than 20. Display kind, weight, legs.
sql_command = '''
select kind, weight, legs
from animals a
where legs > 2 and weight < 20
'''
pd.read_sql_query(sql_command,connection)

     kind  weight  legs
0     cat      10     4
1  ferret      10     4

In [106]:
# 4. SELECT the average weight for all the animals with 2 legs and the animals with 4 legs (by using GROUP BY).
sql_command = '''
select legs, avg(weight)
from animals 
group by legs
'''
pd.read_sql_query(sql_command,connection)

   legs  avg(weight)
0     2  4005.333333
1     4    13.333333